In [6]:
import pandas as pd
file_path = "shopping_data.csv"
shopping_df = pd.read_csv(file_path)
shopping_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [7]:
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [11]:
# find null values
for column in shopping_df.columns:
    print(f"column {column} has {shopping_df[column].isnull().sum()} null values.")

column CustomerID has 0 null values.
column Card Member has 2 null values.
column Age has 2 null values.
column Annual Income has 0 null values.
column Spending Score (1-100) has 1 null values.

In [15]:
# drop nulls
shopping_df = shopping_df.dropna()
print(f'Duplicate entries: {shopping_df.duplicated().sum()}')

Duplicate entries: 0

In [17]:
# remove column
shopping_df.drop(columns=["CustomerID"], inplace=True)
shopping_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [32]:
# transform string data, reduce annual income and change names of columns

def change_string(member):
    if member == 'Yes':
        return 1
    else:
        return 0
    
shopping_df['Card Member'] = shopping_df["Card Member"].apply(change_string)
shopping_df['Annual Incme'] = shopping_df['Annual Incme']/1000
shopping_df.head()

   Card Member   Age  Spending Score (1-100)  Annual Incme
0            0  19.0                    39.0         0.015
1            0  21.0                    81.0         0.015
2            0  20.0                     6.0         0.016
3            0  23.0                    77.0         0.016
4            0  31.0                    40.0         0.017

In [35]:
shopping_df = shopping_df.rename(columns={'Card Memeber':'cardMember', 
                                          'Age':'age', 
                                          'Spending Score (1-100)':'spendingScore',
                                          'Annual Incme':'annualIncome'})
shopping_df.head()

   Card Member   age  spendingScore  annualIncome
0            0  19.0           39.0         0.015
1            0  21.0           81.0         0.015
2            0  20.0            6.0         0.016
3            0  23.0           77.0         0.016
4            0  31.0           40.0         0.017

In [37]:
# Saving cleaned data
file_path = "shopping_data_cleaned.csv"
shopping_df.to_csv(file_path, index=False)

In [38]:
# Saving cleaned data
file_path = "shopping_data_cleaned.xlsx"
shopping_df.to_csv(file_path, index=False)